
<template>
  <div>
    <div id="body1">
      <div id="demo">
        <i
          style="
            cursor: pointer;
            <!-- background: lightblue no-repeat fixed center; -->
            font-style: initial;
            color: azure;
          "
          v-on:click="show = !show"
          >Заселение греками Приазовья</i
        >
        <transition name="slide-fade">
          <p v-if="show">
            Греческие поселения в Приазовье возникли в 1780-е годы. Переселению
            греков в пределы Российской империи, на земли, отвоеванные у Турции,
            способствовала политика правительства Екатерины II. Многолетние
            кровопролитные войны России и Турции за обладание Крымом и
            прилегающими территориями привели к переходу обширнейших земель на
            Азовском и Черном морях под юрисдикцию российского государства.
            Перед российским правительством встал вопрос заселения и освоения
            новых владений. До прихода сюда переселенцев с Крымского полуострова
            местность была малозаселенной, а земли оставались невозделанными.
            Российское правительство, желая подорвать экономическую базу
            Крымского ханства, сложившийся баланс сил, активно стимулировало
            переезд греческого христианского населения с полуострова на
            территории, прилегающие к Азовскому морю. До сих пор остается немало
            спорных вопросов, касающихся истории переселения греков, и
            результаты этого переселения оцениваются неоднозначно. Начавшийся в
            1778 г. переселение православного греческого населения из Крыма в
            Приазовье продолжалось несколько лет. Целые вереницы телег и
            повозок, запряженных волами и лошадьми, двигались в сторону
            Азовского побережья. Как выяснилось, эти события более чем
            двухсотлетней давности, хорошо известные учителям, краеведам и
            другим представителям греческой интеллигенции, оказались почти
            полностью забыты «простыми» греками. Так, некоторые из наших
            информантов затруднялись в ответе на вопрос, как получилось, что их
            предки поселились в Приазовье. Если же указывалось на то, что в
            Крыму встречаются сходные топонимы (Ялта, Гурзуф, Старый Крым),
            многие утверждали, что это не более чем простое совпадение, т.е. не
            усматривали в этом «совпадении» никакой связи. Тем не менее, в
            семьях греческой интеллигенции живы рассказы о переселении. Судя по
            этим рассказам, переселенцы не имели четкого плана действий. Им
            предоставлялась свобода выбора земель для поселения. Валентина
            Ивановна Челпан 1950 г.р. в поселке Ялта рассказала, что ее родное
            селение основали зимой выбившиеся из сил переселенцы. Они очень
            долго странствовали по заснеженной степи, увидели вдалеке море,
            воскликнули: «Ялло!» (jalo "море" на местом диалекте) и решили
            поселиться именно в этом месте, назвав его «Ялта» (этой народной
            этимологии придерживается большая часть населения поселка). В
            действительности же переселенцы называли свои новые поселения по
            названиям тех мест на территории Крыма, откуда они пришли. На
            современной карте Донецкой области мы можем увидеть села: Ялта,
            Урзуф, Старый Крым, Сартана и др. В самой Ялте есть район под
            названием Массандра. Несколько десятилетий ушло у переселенцев на
            освоение новых территорий. Основными занятиями местных жителей было
            землепашество, разведение мелкого рогатого скота, овощеводство. В
            греческих поселениях процветали ремесла и торговля. Долгое время
            села оставались практически моноэтничными. Позже здесь стали
            селиться русские, украинцы, армяне, представители других
            национальностей. Всего в Приазовье греками было основано 21 село и
            заселен город Мариуполь, который и по сию пору называют "греческой
            столицей Украины".
          </p>
        </transition>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data: () => ({
    show: false,
  }),
};
</script>
<style scoped>
/* ...demo
{background: lightblue url("") no-repeat fixed center;
} */
v-window__prev .v-btn__content,
v-window__next .v-btn__content {
  background-color: red;
}
v-icon notranslate mdi mdi-chevron-left theme--dark {
  font-size: 36px;
}

.slide-fade-enter-active {
  transition: all 0.3s ease;
}
.slide-fade-leave-active {
  transition: all 0.8s cubic-bezier(1, 0.5, 0.8, 1);
}
.slide-fade-enter, .slide-fade-leave-to
/* .slide-fade-leave-active до версии 2.1.8 */ {
  transform: translateX(10px);
  opacity: 0;
}
#body1 {
  background-image: url("https://firebasestorage.googleapis.com/v0/b/my-sait-v.appspot.com/o/mai%20foto%2FImage-1.jpg?alt=media&token=c74b8004-b703-4a0a-991a-12312c163ed6");
  background-color: #cccccc;
  width: center;
}
</style>